## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          RESOURCE                          |
|--------|------------------------------------------------------------|
| add    | `aws_security_group.ecs_tasks`                             |
|        | `aws_security_group_rule.ecs_tasks_egress_all`             |
|        | `aws_security_group_rule.ecs_tasks_egress_rds`             |
|        | `aws_security_group_rule.ecs_tasks_ingress_alb`            |
|        | `module.ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`         |
|        | `module.ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`      |
|        | `module.ecs.aws_appautoscaling_target.this[0]`             |
|        | `module.ecs.aws_cloudwatch_log_group.this`                 |
|        | `module.ecs.aws_ecs_cluster.this[0]`                       |
|        | `module.ecs.aws_ecs_cluster_capacity_providers.this[0]`    |
|        | `module.ecs.aws_ecs_service.this`                          |
|        | `module.ecs.aws_ecs_task_definition.this`                  |
|        | `module.ecs.aws_iam_policy.this_task[0]`                   |
|        | `module.ecs.aws_iam_policy.this_task_exec`                 |
|        | `module.ecs.aws_iam_role.this_task`                        |
|        | `module.ecs.aws_iam_role.this_task_exec`                   |
|        | `module.ecs.aws_iam_role_policy_attachment.this_task[0]`   |
|        | `module.ecs.aws_iam_role_policy_attachment.this_task_exec` |

| CHANGE |           OUTPUT            |
|--------|-----------------------------|
| add    | `cluster_arn`               |
|        | `service_id`                |
|        | `task_exec_role_arn`        |
|        | `cluster_name`              |
|        | `service_port`              |
|        | `task_definition_family`    |
|        | `cloudwatch_log_group_arn`  |
|        | `cloudwatch_log_group_name` |
|        | `service_name`              |
|        | `task_definition_revision`  |
|        | `task_role_arn`             |
|        | `cluster_id`                |
|        | `ecs_security_group_id`     |
|        | `task_definition_arn`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for blawx staging ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "blawx-staging-ecs-tasks-sg"
      + owner_id               = (known after apply)
      + region                 = "ca-central-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-ecs-tasks-sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-ecs-tasks-sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0820e0cc9a21f8711"
    }

  # aws_security_group_rule.ecs_tasks_egress_all will be created
  + resource "aws_security_group_rule" "ecs_tasks_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "ca-central-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_tasks_egress_rds will be created
  + resource "aws_security_group_rule" "ecs_tasks_egress_rds" {
      + description              = "Allow outbound traffic to RDS PostgreSQL"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ca-central-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0710b5b8c6d648561"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.ecs_tasks_ingress_alb will be created
  + resource "aws_security_group_rule" "ecs_tasks_ingress_alb" {
      + description              = "Allow inbound traffic from ALB on port 8000"
      + from_port                = 8000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ca-central-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0a398258348291519"
      + to_port                  = 8000
      + type                     = "ingress"
    }

  # module.ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "blawx-staging-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParametersByPath",
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.ecs.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/blawx-staging-cluster/blawx-staging-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/blawx-staging-cluster/blawx-staging-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + region             = "ca-central-1"
      + resource_id        = "service/blawx-staging-cluster/blawx-staging-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }

      + suspended_state (known after apply)
    }

  # module.ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/blawx-staging-cluster/blawx-staging-service"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "blawx-staging-cluster"
      + region   = "ca-central-1"
      + tags     = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "blawx-staging-cluster"
      + id                 = (known after apply)
      + region             = "ca-central-1"

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "blawx-staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "blawx-staging-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + region                             = "ca-central-1"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "blawx-container"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:targetgroup/blawx-staging-app-tg/c9ae7767df34d77b"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-057e8731d4b371e3c",
              + "subnet-0dd1c3c1dd62ee1d6",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "ALLOWED_HOSTS"
                          + value = "blawx.alpha.canada.ca,localhost"
                        },
                      + {
                          + name  = "DATABASE_HOST"
                          + value = "blawx-staging-database-cluster.cluster-crc48kwkixo1.ca-central-1.rds.amazonaws.com"
                        },
                      + {
                          + name  = "DATABASE_PORT"
                          + value = "5432"
                        },
                      + {
                          + name  = "DEBUG"
                          + value = "False"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "staging"
                        },
                      + {
                          + name  = "LOG_LEVEL"
                          + value = "INFO"
                        },
                      + {
                          + name  = "PORT"
                          + value = "8000"
                        },
                    ]
                  + essential              = true
                  + image                  = "278626299035.dkr.ecr.ca-central-1.amazonaws.com/blawx-staging:latest"
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/blawx-staging-cluster/blawx-staging-service"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + mountPoints            = []
                  + name                   = "blawx-container"
                  + portMappings           = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "DATABASE_NAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/database_name"
                        },
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/database_password"
                        },
                      + {
                          + name      = "DATABASE_USER"
                          + valueFrom = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/database_username"
                        },
                      + {
                          + name      = "DJANGO_SECRET_KEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/django_secret_key"
                        },
                    ]
                  + systemControls         = []
                  + ulimits                = [
                      + {
                          + hardLimit = 1000000
                          + name      = "nofile"
                          + softLimit = 1000000
                        },
                    ]
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "blawx-staging-service"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + region                   = "ca-central-1"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "blawx-staging-service_ecs_task_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:278626299035:parameter/blawx/staging/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
    }

  # module.ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "blawx-staging-service_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
    }

  # module.ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "blawx-staging-service_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "blawx-staging-service_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blawx-staging-service_ecs_task_role"
    }

  # module.ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blawx-staging-service_ecs_task_exec_role"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_log_group_arn  = (known after apply)
  + cloudwatch_log_group_name = "/aws/ecs/blawx-staging-cluster/blawx-staging-service"
  + cluster_arn               = (known after apply)
  + cluster_id                = (known after apply)
  + cluster_name              = "blawx-staging-cluster"
  + ecs_security_group_id     = (known after apply)
  + service_id                = (known after apply)
  + service_name              = "blawx-staging-service"
  + service_port              = "8000"
  + task_definition_arn       = (known after apply)
  + task_definition_family    = "blawx-staging-service"
  + task_definition_revision  = (known after apply)
  + task_exec_role_arn        = (known after apply)
  + task_role_arn             = (known after apply)

Warning: Deprecated attribute

  on .terraform/modules/ecs.sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
  85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.ecs.aws_service_discovery_service.this,
  on .terraform/modules/ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
